espruino/Espruino/targets/esp32/jshardware.c
void jshKill() {
}

/**
 * Reset the Espruino environment.
 */
void jshReset() {
  jshResetDevices();
  jshPinDefaultPullup() ;
//  UartReset();
  RMTReset();
  ADCReset();
  I2CReset();
  SPIReset();
#ifdef BLUETOOTH
  if(ESP32_Get_NVS_Status(ESP_NETWORK_BLE)) gatts_reset(false);
#endif
}

/**
 * Re-init the ESP32 after a soft-reset
 */
void jshSoftInit() {
#ifdef USE_NET
  if(ESP32_Get_NVS_Status(ESP_NETWORK_WIFI)) jswrap_esp32_wifi_soft_init();
#endif
#ifdef USE_NEOPIXEL
  neopixelConfiguredGPIO = -1;
#endif
}

/**
 * Handle whatever needs to be done in the idle loop when there's nothing to do.
 *
 * Nothing is needed on the ESP32.
 */
void jshIdle() {

}

// ESP32 chips don't have a serial number but they do have a MAC address
int jshGetSerialNumber(unsigned char *data, int maxChars) {
  assert(maxChars >= 6); // it's 32
  esp_efuse_mac_get_default(data);
  return 6;
}

void jshInterruptOff() {
  //taskDISABLE_INTERRUPTS();
}

void jshInterruptOn()  {
  //taskENABLE_INTERRUPTS();
}

/// Are we currently in an interrupt?
bool jshIsInInterrupt() {
  return false; // FIXME!
}

/// Enter simple sleep mode (can be woken up by interrupts). Returns true on success
bool jshSleep(JsSysTime timeUntilWake) {
#if ESP_IDF_VERSION_MAJOR>=4
  double ms = jshGetMillisecondsFromTime(timeUntilWake);
  if (ms>50) ms=50; // hack for now - ideally jshHadEvent called from UART IRQs would break out of vTaskDelay
  vTaskDelay(ms / portTICK_PERIOD_MS);
#else
  UNUSED(timeUntilWake);
  // we never sleep in older IDFs
#endif
  return true;
} // End of jshSleep


/**
 * Delay (blocking) for the supplied number of microseconds.
 */
void jshDelayMicroseconds(int microsec) {
  ets_delay_us((uint32_t)microsec);
} // End of jshDelayMicroseconds



/**
 * Set the state of the specific pin.
 *
 * The possible states are:
 *
 * JSHPINSTATE_UNDEFINED
 * JSHPINSTATE_GPIO_OUT
 * JSHPINSTATE_GPIO_OUT_OPENDRAIN
 * JSHPINSTATE_GPIO_OUT_OPENDRAIN_PULLUP
 * JSHPINSTATE_GPIO_IN
 * JSHPINSTATE_GPIO_IN_PULLUP
 * JSHPINSTATE_GPIO_IN_PULLDOWN
 * JSHPINSTATE_ADC_IN
 * JSHPINSTATE_AF_OUT
 * JSHPINSTATE_AF_OUT_OPENDRAIN
 * JSHPINSTATE_USART_IN
 * JSHPINSTATE_USART_OUT
 * JSHPINSTATE_DAC_OUT
 * JSHPINSTATE_I2C
 *
 * This function is exposed indirectly through the exposed global function called
 * `pinMode()`.  For example, `pinMode(pin, "input")` will set the given pin to input.
 */
void jshPinSetState(
  Pin pin,                 //!< The pin to have its state changed.
    JshPinState state        //!< The new desired state of the pin.
  ) {
  /* Make sure we kill software PWM if we set the pin state
   * after we've started it */
  if (BITFIELD_GET(jshPinSoftPWM, pin)) {
    BITFIELD_SET(jshPinSoftPWM, pin, 0);
    jstPinPWM(0,0,pin);
  }
  gpio_mode_t mode;
  gpio_pull_mode_t pull_mode=GPIO_FLOATING;
  bool negated = pinInfo[pin].port & JSH_PIN_NEGATED;
  switch(state) {
  case JSHPINSTATE_GPIO_OUT:
    mode = GPIO_MODE_INPUT_OUTPUT;
    break;
  case JSHPINSTATE_GPIO_IN:
    mode = GPIO_MODE_INPUT;
    break;
  case JSHPINSTATE_GPIO_IN_PULLUP:
    mode = GPIO_MODE_INPUT;
    pull_mode= negated ? GPIO_PULLDOWN_ONLY : GPIO_PULLUP_ONLY;
    break;
  case JSHPINSTATE_GPIO_IN_PULLDOWN:
    mode = GPIO_MODE_INPUT;
    pull_mode= negated ? GPIO_PULLUP_ONLY : GPIO_PULLDOWN_ONLY;
    break;
  case JSHPINSTATE_GPIO_OUT_OPENDRAIN:
    mode = GPIO_MODE_INPUT_OUTPUT_OD;
    if (negated) jsError( "jshPinSetState: can't do Open Drain on negated pin");
    break;
  case JSHPINSTATE_GPIO_OUT_OPENDRAIN_PULLUP: // not possible if negated
    mode = GPIO_MODE_INPUT_OUTPUT_OD;
    pull_mode= GPIO_PULLUP_ONLY;
    if (negated) jsError( "jshPinSetState: can't do Open Drain on negated pin");
    break;
  default:
    jsError( "jshPinSetState: Unexpected state: %d", state);
  return;
  }
  gpio_num_t gpioNum = pinToESP32Pin(pin);
  gpio_set_direction(gpioNum, mode);
  gpio_set_pull_mode(gpioNum, pull_mode);
#if ESP_IDF_VERSION_MAJOR>=5
  esp_rom_gpio_pad_select_gpio(gpioNum);
#else
  gpio_pad_select_gpio(gpioNum);
#endif
  g_pinState[pin] = state; // remember what we set this to...
}


/**
 * Return the current state of the selected pin.
 * \return The current state of the selected pin.
 */
JshPinState jshPinGetState(Pin pin) {
  if ( jshPinGetValue(pin) & 1 )
    return g_pinState[pin] | JSHPINSTATE_PIN_IS_ON;
  return g_pinState[pin];
}

/**
 * Check if state is default - return true if default
*/
bool jshIsPinStateDefault(Pin pin, JshPinState state) {
  return state == JSHPINSTATE_GPIO_IN_PULLUP || state == JSHPINSTATE_ADC_IN;
}

//===== GPIO and PIN stuff =====

/**
 * Set the value of the corresponding pin.
 */
void jshPinSetValue(
    Pin pin,   //!< The pin to have its value changed.
    bool value //!< The new value of the pin.
  ) {
  if (pinInfo[pin].port & JSH_PIN_NEGATED) value=!value;
  gpio_num_t gpioNum = pinToESP32Pin(pin);
#if ESP_IDF_VERSION_MAJOR>=5
  gpio_iomux_out(gpioNum, SIG_GPIO_OUT_IDX, 0); // reset pin to be GPIO in case it was used as rmt or something else
#else
  gpio_matrix_out(gpioNum,SIG_GPIO_OUT_IDX,0,0);  // reset pin to be GPIO in case it was used as rmt or something else
#endif
  gpio_set_level(gpioNum, (uint32_t)value);
}


/**
 * Get the value of the corresponding pin.
 * \return The current value of the pin.
 */
bool CALLED_FROM_INTERRUPT jshPinGetValue( // can be called at interrupt time
    Pin pin //!< The pin to have its value read.
  ) {
  gpio_num_t gpioNum = pinToESP32Pin(pin);
  bool value = gpio_get_level(gpioNum);
  if (pinInfo[pin].port & JSH_PIN_NEGATED) value=!value;
  return value;
}


JsVarFloat jshPinAnalog(Pin pin) {
#if ESP_IDF_VERSION_MAJOR >= 5
  jsError("jshPinAnalog(Pin pin) is not implemented yet");
  return NAN;
#else
  if (pinInfo[pin].analog == JSH_ANALOG_NONE)
    return NAN;
  JsVarFloat v = (JsVarFloat) readADC(pin) / 4096;
  if (pinInfo[pin].port & JSH_PIN_NEGATED) v=1-v;
  return v;
#endif
}


int jshPinAnalogFast(Pin pin) {
#if ESP_IDF_VERSION_MAJOR >= 5
  jsError("jshPinAnalogFast(Pin pin) is not implemented yet");
  return NAN;
#else
  if (pinInfo[pin].analog == JSH_ANALOG_NONE)
    return 0;
  int v = readADC(pin) << 4;
  if (pinInfo[pin].port & JSH_PIN_NEGATED) v=65535-v;
  return v;
#endif
}


/**
 * Set the output PWM value.
 */
JshPinFunction jshPinAnalogOutput(Pin pin,
    JsVarFloat value,
    JsVarFloat freq,
    JshAnalogOutputFlags flags) { // if freq<=0, the default is used
#if ESP_IDF_VERSION_MAJOR >= 5
    jsError("writeDAC() is not implemented yes");
#else
  UNUSED(flags);
  if (pinInfo[pin].port & JSH_PIN_NEGATED) value=1-value;
  if (value<0) value=0;
  if (value>1) value=1;
  if (!isfinite(freq)) freq=0;
  if(pin == 25 || pin == 26){
  if(flags & (JSAOF_ALLOW_SOFTWARE | JSAOF_FORCE_SOFTWARE)) jsError("pin does not support software PWM");
    writeDAC(pin,(uint8_t)(value * 256));
  }
  else{
  if(flags & JSAOF_ALLOW_SOFTWARE){
    if (!jshGetPinStateIsManual(pin)){
        BITFIELD_SET(jshPinSoftPWM, pin, 0);
        jshPinSetState(pin, JSHPINSTATE_GPIO_OUT);
      }
      BITFIELD_SET(jshPinSoftPWM, pin, 1);
      if ((freq<=0)) freq=50;
      jstPinPWM(freq, value, pin);
      return 0;
    }
    else writePWM(pin,( uint16_t)(value * PWMTimerRange),(int) freq);
  }
#endif
  return 0;
}


/**
 *
 */
void jshSetOutputValue(JshPinFunction func, int value) {
#if ESP_IDF_VERSION_MAJOR >= 5
    jsError("writeDAC() is not implemented yes");
#else
  int pin;
  if (JSH_PINFUNCTION_IS_DAC(func)) {
    uint8_t val = (uint8_t)(value >> 8);
    switch (func & JSH_MASK_INFO) {
      case JSH_DAC_CH1:  writeDAC(25,val); break;
      case JSH_DAC_CH2:  writeDAC(26,val); break;
    }
  }
  else{
    pin = ((func >> JSH_SHIFT_INFO) << 4) + ((func >> JSH_SHIFT_TYPE) & 15);
    // convert the 16 bit value to a 10 bit value.
    value=value >> (16 - PWMTimerBit);
    setPWM( (Pin)pin, (uint16_t)value);
  }
#endif
}

void jshEnableWatchDog(JsVarFloat timeout) {
#ifndef CONFIG_ESP_TASK_WDT_EN
  return;
#else
#ifdef QEMU_BUILD
#else
  wdt_enabled = true;
#if ESP_IDF_VERSION_MAJOR >= 5
  // ESP-IDF 5 uses a config struct
  esp_task_wdt_config_t wdt_config = {
      .timeout_ms = (int)(timeout * 1000 + 0.5), // convert seconds to milliseconds
  };
  esp_task_wdt_init(&wdt_config);
#else
  // ESP-IDF 4 compatibility
  esp_task_wdt_init((int)(timeout + 0.5), true);
#endif
  esp_task_wdt_add(NULL); // add current thread to WDT watch
#endif
#endif
}
// Kick the watchdog
void jshKickWatchDog() {
#ifndef CONFIG_ESP_TASK_WDT_EN
  return;
#else 

#ifdef ESPR_DISABLE_KICKWATCHDOG_PIN // if this pin is asserted, don't kick the watchdog
  if (jshPinGetValue(ESPR_DISABLE_KICKWATCHDOG_PIN)) return;
#endif
  if (wdt_enabled)
    esp_task_wdt_reset();
#endif
}


/**
 * Get the state of the pin associated with the event flag.
 */
bool CALLED_FROM_INTERRUPT jshGetWatchedPinState(IOEventFlags eventFlag) { // can be called at interrupt time
  gpio_num_t gpioNum = pinToESP32Pin((Pin)(eventFlag-EV_EXTI0));
  bool value = gpio_get_level(gpioNum);
  if (pinInfo[gpioNum].port & JSH_PIN_NEGATED) value=!value;
  return value;
}


/**
 * Determine whether the pin can be watchable.
 * \return Returns true if the pin is watchable.
 */
bool jshCanWatch(
    Pin pin //!< The pin that we are asking whether or not we can watch it.
  ) {
#ifdef CONFIG_IDF_TARGET_ESP32C3
  return (pin!=18) && (pin!=19); // USB
#else
  return !( pin >= 6 && pin <= 12 /*SPI FLASH*/);
#endif
}


/**
 * Do what ever is necessary to watch a pin.
 * \return The event flag for this pin.
 */
IOEventFlags jshPinWatch(
      Pin pin,          //!< The pin to be watched.
      bool shouldWatch, //!< True for watching and false for unwatching.
      JshPinWatchFlags flags
    ) {
  gpio_num_t gpioNum = pinToESP32Pin(pin);
  if(shouldWatch){
    gpio_set_intr_type(gpioNum,GPIO_INTR_ANYEDGE);             //set posedge interrupt
    gpio_set_direction(gpioNum,GPIO_MODE_INPUT);               //set as input
    gpio_set_pull_mode(gpioNum,GPIO_PULLUP_ONLY);              //enable pull-up mode
    gpio_intr_enable(gpioNum);                                 //enable interrupt
    return pinToEV_EXTI(gpioNum);
  } else{
    if(gpio_intr_disable(gpioNum) == ESP_ERR_INVALID_ARG){     //disable interrupt
        jsError("*** jshPinWatch error");
    }
  }
  return EV_NONE;
}


/**
 *
 */
JshPinFunction jshGetCurrentPinFunction(Pin pin) {
  if (jshIsPinValid(pin)) {
    int i;
    for (i=0;i<JSH_PININFO_FUNCTIONS;i++) {
      JshPinFunction func = pinInfo[pin].functions[i];
      if (JSH_PINFUNCTION_IS_TIMER(func) ||
          JSH_PINFUNCTION_IS_DAC(func))
        return func;
    }
  }
  return JSH_NOTHING;
}


/**
 * Determine if a given event is associated with a given pin.
 * \return True if the event is associated with the pin and false otherwise.
 */
bool jshIsEventForPin(
    IOEventFlags eventFlags, //!< The event type that has been detected.
    Pin pin         //!< The identity of a pin.
  ) {
  return IOEVENTFLAGS_GETTYPE(eventFlags) == pinToEV_EXTI(pin);
}

